Revit 2024 API
ReferenceArrayArrayIterator Class
An iterator to a ReferenceArray array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class ReferenceArrayArrayIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class ReferenceArrayArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class ReferenceArrayArrayIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ReferenceArrayArrayIterator
See Also
ReferenceArrayArrayIterator Members
Autodesk.Revit.DB Namespace